### Pandas 
- it is one of the most important modules of data science
- used to work with data in the form of frames/table 
- stands for panel data
- data Analysis ,manipulation and cleaning
  - Data Analysis means analysising the data
    - Statistics of the data,volume of data etc
  - Data Manipulation means transforming the data from one format to another
    - Merging,Conmcatenmating etc
  - Data  cleaning means removing the data 
    - Null data means NaN (Not a number)
- 2 data structures in pandas
 - 1) Series
    - Sequential data
  - 2) DataFrame
    - Data in tabular format i.e., rows and columns
- **Instllation**
   - pip install pandas
   - import pandas

In [8]:
import pandas as pd
pd.__version__

'1.2.4'

In [9]:
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_is_numpy_dev',
 '_lib',
 '_libs',
 '_np_version_under1p17',
 '_np_version_under1p18',
 '_testing',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [10]:
# we can create series using str,tuple,list and dict
st="I am A.L.Sankeerthana"
pd.Series(st)

0    I am A.L.Sankeerthana
dtype: object

In [11]:
# try with input().split()
li=input("type your clg name: ").split()
pd.Series(li)

type your clg name: vr si

0    vr
1    si
dtype: object

In [12]:
print(pd.Series(li))

0    vr
1    si
dtype: object

In [13]:
li=input()
pd.Series(li)

1 2 3 4

0    1 2 3 4
dtype: object

In [15]:
l=int(input())
pd.Series(l)

1 2 3 4

ValueError: invalid literal for int() with base 10: '1 2 3 4'

In [16]:
#Using tuple/list
t=(6,7,3,4,5)
pd.Series(t)

0    6
1    7
2    3
3    4
4    5
dtype: int64

In [17]:
pd.Series(range(10,30,6))

0    10
1    16
2    22
3    28
dtype: int64

In [56]:
#using dictionary
dic={'34' : "thirty four",12:0,'tuple':(9,2,4),'list': [1,7,8]}
s=pd.Series(dic)
s

34       thirty four
12                 0
tuple      (9, 2, 4)
list       [1, 7, 8]
dtype: object

In [21]:
d={12,17,89}
pd.Series(d)

TypeError: 'set' type is unordered

In [23]:
import numpy as np
ar=np.arange(10,45,5)
a=pd.Series(ar)
a

0    10
1    15
2    20
3    25
4    30
5    35
6    40
dtype: int32

In [24]:
a[0]

10

In [25]:
a[0:4]

0    10
1    15
2    20
3    25
dtype: int32

In [27]:
a[0:len(a)]

0    10
1    15
2    20
3    25
4    30
5    35
6    40
dtype: int32

In [29]:
a.index

RangeIndex(start=0, stop=7, step=1)

In [33]:
a.index=[4,5,67,3,89,76,73]
a

4     10
5     15
67    20
3     25
89    30
76    35
73    40
dtype: int32

In [35]:
li2=[9,2,90,89,'hi']
ind=[n for n in range(3,8)]
pd.Series(li2,index=ind)

3     9
4     2
5    90
6    89
7    hi
dtype: object

In [37]:
# pass the user index to series created using dict
#len(dic)
ix=[num for num in range(10,14)]
pd.Series(dic,index=ix)

10    NaN
11    NaN
12      0
13    NaN
dtype: object

In [38]:
s.index

Index(['3', 12, 'tuple', 'list'], dtype='object')

In [39]:
s['tuple']

(9, 8)

In [40]:
s['tuple'][1]

8

In [41]:
a.index[4:76]

Int64Index([89, 76, 73], dtype='int64')

### DataFrames
- datab is in 2d format

In [57]:
import numpy as np
import pandas as pd
pd.DataFrame(dic)

            34  12  tuple  list
0  thirty four   0      9     1
1  thirty four   0      2     7
2  thirty four   0      4     8

In [61]:
data={'int' : 90,'float': 90.73,'str':"keerthi",'roll': 67}
nk=pd.DataFrame(data,index=[5,6,89])
nk

    int  float      str  roll
5    90  90.73  keerthi    67
6    90  90.73  keerthi    67
89   90  90.73  keerthi    67

In [62]:
pd.concat([s,nk])

                 0  float   int  roll      str
34     thirty four    NaN   NaN   NaN      NaN
12               0    NaN   NaN   NaN      NaN
tuple    (9, 2, 4)    NaN   NaN   NaN      NaN
list     [1, 7, 8]    NaN   NaN   NaN      NaN
5              NaN  90.73  90.0  67.0  keerthi
6              NaN  90.73  90.0  67.0  keerthi
89             NaN  90.73  90.0  67.0  keerthi

In [71]:
import pandas as pd
n={'name':"keer",'roll':67,'clg':"vrsec"}
a=pd.DataFrame(n,index=[100,99,98])
a
m={'int': 23,'float': 67.98,'str':'keer'}
b=pd.DataFrame(m,index=[23,34,45])
b
pd.concat([a,b])

     name  roll    clg   int  float   str
100  keer  67.0  vrsec   NaN    NaN   NaN
99   keer  67.0  vrsec   NaN    NaN   NaN
98   keer  67.0  vrsec   NaN    NaN   NaN
23    NaN   NaN    NaN  23.0  67.98  keer
34    NaN   NaN    NaN  23.0  67.98  keer
45    NaN   NaN    NaN  23.0  67.98  keer

In [6]:
#merging two dataframes
import pandas as pd
df3=pd.DataFrame({'int_rate':[2,1,2,3],'int_gdp':[50,45,45,67]},index=[2001,2002,2003,2004])
df3

      int_rate  int_gdp
2001         2       50
2002         1       45
2003         2       45
2004         3       67

In [5]:
#joining two dataframes
import pandas as pd
df4=pd.DataFrame({'low_tier_hpi':[80,90,70,60],'unemployment':[1,3,5,7]},index=[2001,2003,2003,2005])
df4

      low_tier_hpi  unemployment
2001            80             1
2003            90             3
2003            70             5
2005            60             7

In [16]:
df3.join(df4) # arranged based on index values

      int_rate  int_gdp  low_tier_hpi  unemployment
2001         2       50          80.0           1.0
2002         1       45           NaN           NaN
2003         2       45          90.0           3.0
2003         2       45          70.0           5.0
2004         3       67           NaN           NaN

In [8]:
# merging the dataframes having similar column values 
m=pd.DataFrame({'a':[4,5,6,7],'b':[30,50,60,70],'c':['a','b','c','d']},index=["first","second","third","fourth"])
m

        a   b  c
first   4  30  a
second  5  50  b
third   6  60  c
fourth  7  70  d

In [9]:
# merging the dataframes having similar column values 
n=pd.DataFrame({'a':[4,9,6,7],'b':[30,80,60,70],'c':['a','b','c','d']},index=["first","second","third","fourth"])
n

        a   b  c
first   4  30  a
second  9  80  b
third   6  60  c
fourth  7  70  d

In [10]:
m.merge(n)

   a   b  c
0  4  30  a
1  6  60  c
2  7  70  d

In [11]:
new=m.merge(n)
new.columns=['f','s','th'] # renaming the col values
new

   f   s th
0  4  30  a
1  6  60  c
2  7  70  d

In [15]:
new=m.merge(n) # combining
new.columns=['f','s','th'] # renaming the row values
new.index=[5,6,7] # updating row values
new

   f   s th
5  4  30  a
6  6  60  c
7  7  70  d

In [17]:
m.merge(n,on='c')

   a_x  b_x  c  a_y  b_y
0    4   30  a    4   30
1    5   50  b    9   80
2    6   60  c    6   60
3    7   70  d    7   70

In [18]:
# date range
dates=pd.date_range('2022-01-01','2022-01-10')
pd.Series(dates)

0   2022-01-01
1   2022-01-02
2   2022-01-03
3   2022-01-04
4   2022-01-05
5   2022-01-06
6   2022-01-07
7   2022-01-08
8   2022-01-09
9   2022-01-10
dtype: datetime64[ns]

In [19]:
dt=pd.date_range('2022-01-10',periods=5)
pd.Series(dt)

0   2022-01-10
1   2022-01-11
2   2022-01-12
3   2022-01-13
4   2022-01-14
dtype: datetime64[ns]

In [20]:
temp=[30,32,35,40,31]
pd.Series(temp,index=dt)

2022-01-10    30
2022-01-11    32
2022-01-12    35
2022-01-13    40
2022-01-14    31
Freq: D, dtype: int64

In [23]:
new

   f   s th
5  4  30  a
6  6  60  c
7  7  70  d

In [29]:
new.index[2]

7

In [30]:
m

        a   b  c
first   4  30  a
second  5  50  b
third   6  60  c
fourth  7  70  d

#### Working with .csv file
  - reading .csv file located at same location
  - pd.read_csv('flename')

In [31]:
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_is_numpy_dev',
 '_lib',
 '_libs',
 '_np_version_under1p17',
 '_np_version_under1p18',
 '_testing',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [100]:
marks=pd.read_csv('marks.csv')
marks

  Roll_No Name  Maths  Discrete  OS  CO    DS
0      A1    X     60        70  70  90   NaN
1      A2    Y     90        45  67  50   NaN
2      B1    X     62        72  39  71  92.0
3      B2    Y     93        49  64  78  59.0
4      C1    X     60        70  35  74  98.0
5      C2    Y     90        45  65  75  55.0
6      D1    X     66        72  39  78  94.0
7      D2    Y     92        49  62  77  58.0

In [38]:
# Data Processing
# select 5 random samples
marks.sample(3)

  Roll_No Name  Maths  Discrete  OS  CO  DS
4      C1    X     60        70  35  74  98
5      C2    Y     90        45  65  75  55
1      A2    Y     90        45  67  73  50

In [41]:
marks.head(3) # default first 5 lines

  Roll_No Name  Maths  Discrete  OS  CO  DS
0      A1    X     60        70  30  70  90
1      A2    Y     90        45  67  73  50
2      B1    X     62        72  39  71  92

In [42]:
marks.tail(4) # default last 5 lines

  Roll_No Name  Maths  Discrete  OS  CO  DS
4      C1    X     60        70  35  74  98
5      C2    Y     90        45  65  75  55
6      D1    X     66        72  39  78  94
7      D2    Y     92        49  62  77  58

In [46]:
# accessing 1 particular col data
marks['Maths']

0    60
1    90
2    62
3    93
4    60
5    90
6    66
7    92
Name: Maths, dtype: int64

In [48]:
marks[['Roll_No','Name','Maths']] # accessing multiple required cols of data

  Roll_No Name  Maths
0      A1    X     60
1      A2    Y     90
2      B1    X     62
3      B2    Y     93
4      C1    X     60
5      C2    Y     90
6      D1    X     66
7      D2    Y     92

In [50]:
# 
new=pd.read_csv('marks.csv',usecols=['Name','OS'])
new

  Name  OS
0    X  30
1    Y  67
2    X  39
3    Y  64
4    X  35
5    Y  65
6    X  39
7    Y  62

In [54]:
marks.columns

Index(['Roll_No', 'Name', 'Maths', 'Discrete', 'OS', 'CO', 'DS'], dtype='object')

In [60]:
marks.index

RangeIndex(start=0, stop=8, step=1)

In [62]:
marks.dtypes

Roll_No     object
Name        object
Maths        int64
Discrete     int64
OS           int64
CO           int64
DS           int64
dtype: object

In [63]:
marks.info

<bound method DataFrame.info of   Roll_No Name  Maths  Discrete  OS  CO  DS
0      A1    X     60        70  30  70  90
1      A2    Y     90        45  67  73  50
2      B1    X     62        72  39  71  92
3      B2    Y     93        49  64  78  59
4      C1    X     60        70  35  74  98
5      C2    Y     90        45  65  75  55
6      D1    X     66        72  39  78  94
7      D2    Y     92        49  62  77  58>

In [64]:
marks.describe()

           Maths   Discrete         OS         CO         DS
count   8.000000   8.000000   8.000000   8.000000   8.000000
mean   76.625000  59.000000  50.125000  74.500000  74.500000
std    15.774641  12.939419  15.679263   3.070598  20.605131
min    60.000000  45.000000  30.000000  70.000000  50.000000
25%    61.500000  48.000000  38.000000  72.500000  57.250000
50%    78.000000  59.500000  50.500000  74.500000  74.500000
75%    90.500000  70.500000  64.250000  77.250000  92.500000
max    93.000000  72.000000  67.000000  78.000000  98.000000

In [68]:
marks.Maths.value_counts()

90    2
60    2
92    1
66    1
93    1
62    1
Name: Maths, dtype: int64

In [69]:
marks['Maths'].value_counts()

90    2
60    2
92    1
66    1
93    1
62    1
Name: Maths, dtype: int64

In [70]:
marks.shape

(8, 7)

In [71]:
marks.sort_values('Maths')

  Roll_No Name  Maths  Discrete  OS  CO  DS
0      A1    X     60        70  30  70  90
4      C1    X     60        70  35  74  98
2      B1    X     62        72  39  71  92
6      D1    X     66        72  39  78  94
1      A2    Y     90        45  67  73  50
5      C2    Y     90        45  65  75  55
7      D2    Y     92        49  62  77  58
3      B2    Y     93        49  64  78  59

In [73]:
marks.sort_values('Roll_No',ascending=False)

  Roll_No Name  Maths  Discrete  OS  CO  DS
7      D2    Y     92        49  62  77  58
6      D1    X     66        72  39  78  94
5      C2    Y     90        45  65  75  55
4      C1    X     60        70  35  74  98
3      B2    Y     93        49  64  78  59
2      B1    X     62        72  39  71  92
1      A2    Y     90        45  67  73  50
0      A1    X     60        70  30  70  90

In [78]:
#adding new col info df
marks['Total']=100

In [76]:
marks

  Roll_No Name  Maths  Discrete  OS  CO  DS  Total
0      A1    X     60        70  30  70  90    100
1      A2    Y     90        45  67  73  50    100
2      B1    X     62        72  39  71  92    100
3      B2    Y     93        49  64  78  59    100
4      C1    X     60        70  35  74  98    100
5      C2    Y     90        45  65  75  55    100
6      D1    X     66        72  39  78  94    100
7      D2    Y     92        49  62  77  58    100

In [82]:
marks.OS.sum()

401

In [93]:
marks.sum(0)

Roll_No     A1A2B1B2C1C2D1D2
Name                XYXYXYXY
Maths                    613
Discrete                 472
OS                       401
CO                       596
DS                       596
Total                    800
dtype: object

In [102]:
marks.isnull().sum()

Roll_No     0
Name        0
Maths       0
Discrete    0
OS          0
CO          0
DS          2
dtype: int64

In [101]:
marks.isna()

   Roll_No   Name  Maths  Discrete     OS     CO     DS
0    False  False  False     False  False  False   True
1    False  False  False     False  False  False   True
2    False  False  False     False  False  False  False
3    False  False  False     False  False  False  False
4    False  False  False     False  False  False  False
5    False  False  False     False  False  False  False
6    False  False  False     False  False  False  False
7    False  False  False     False  False  False  False

In [103]:
marks.nunique()

Roll_No     8
Name        2
Maths       6
Discrete    4
OS          7
CO          7
DS          6
dtype: int64

In [112]:
clean=marks.dropna() # removing null characters
# cleanig of data

In [113]:
clean

  Roll_No Name  Maths  Discrete  OS  CO    DS
2      B1    X     62        72  39  71  92.0
3      B2    Y     93        49  64  78  59.0
4      C1    X     60        70  35  74  98.0
5      C2    Y     90        45  65  75  55.0
6      D1    X     66        72  39  78  94.0
7      D2    Y     92        49  62  77  58.0

In [115]:
marks # original df before cleaning

  Roll_No Name  Maths  Discrete  OS  CO    DS
0      A1    X     60        70  70  90   NaN
1      A2    Y     90        45  67  50   NaN
2      B1    X     62        72  39  71  92.0
3      B2    Y     93        49  64  78  59.0
4      C1    X     60        70  35  74  98.0
5      C2    Y     90        45  65  75  55.0
6      D1    X     66        72  39  78  94.0
7      D2    Y     92        49  62  77  58.0

In [116]:
from sklearn.datasets import load_iris

In [117]:
data=load_iris
data